#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dhoppeIT/terraform/runs/run-W9zWVLcDQUAD5Rg7

Waiting for the plan to start...

Terraform v1.1.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.tfe_organization.tfe_organization.default: Refreshing state... [id=dhoppeIT]
module.tfe_organization.tfe_organization_token.default: Refreshing state... [id=dhoppeIT]
module.tfe_oauth_client.tfe_oauth_client.default: Refreshing state... [id=oc-QhxJ1uU28N1QWy4S]
module.tfe_team.tfe_team_token.default: Refreshing state... [id=team-ZJaBkrGTAWpAfWNk]
module.tfe_workspace_hcloud["hcloud-prod"].tfe_workspace.default: Refreshing state... [id=ws-7EN4px3jgiVbHG29]
module.tfe_workspace_terraform.tfe_workspace.default: Refreshing state... [id=ws-28DGqJJq9TJhn1Md]
module.tfe_workspace_aws["aws-stage"].tfe_workspace.default: Refreshing state... [id=ws-cHHxaAdTv94vAsAm]
module.tfe_workspace_hcloud["hcloud-dev"].tfe_workspace.default: Refreshing state... [id=ws-hmyNmKuZJDCJp2JX]
module.tfe_registry["tfe-oauth_client"].tfe_registry_module.default: Refreshing state... [id=mod-viyeWMGM2cF3fLrA]
module.tfe_registry["tfe-variable"].tfe_registry_module.default: Refreshing state... [id=mod-Er3fLtuh364S48r8]
module.tfe_registry["tfe-registry"].tfe_registry_module.default: Refreshing state... [id=mod-uUe6QLD8BAzSwt8M]
module.tfe_registry["tfe-organization"].tfe_registry_module.default: Refreshing state... [id=mod-5KYHsU4SNwGFpoGF]
module.tfe_workspace_hcloud["hcloud-stage"].tfe_workspace.default: Refreshing state... [id=ws-WWubcB8kXMZ4MQgW]
module.tfe_registry["tfe-workspace"].tfe_registry_module.default: Refreshing state... [id=mod-Aw9mwD9ywRDhWSdk]
module.tfe_registry["tfe-notification"].tfe_registry_module.default: Refreshing state... [id=mod-EHbfzdGNNxtMwRVR]
module.tfe_variable_hcloud_stage["HCLOUD_TOKEN"].tfe_variable.default: Refreshing state... [id=var-qNAWmvkAbioftFp6]
module.tfe_notification_hcloud["hcloud-dev"].tfe_notification_configuration.default: Refreshing state... [id=nc-dh6wsfqV23xqBJUA]
module.tfe_variable_hcloud_prod["HCLOUD_TOKEN"].tfe_variable.default: Refreshing state... [id=var-SmndB5Lte7rJvqsg]
module.tfe_notification_hcloud["hcloud-prod"].tfe_notification_configuration.default: Refreshing state... [id=nc-NHnqJh6MVmQGwnzf]
module.tfe_variable_hcloud_dev["HCLOUD_TOKEN"].tfe_variable.default: Refreshing state... [id=var-63xS5kSCWRX7QvxT]
module.tfe_notification_hcloud["hcloud-stage"].tfe_notification_configuration.default: Refreshing state... [id=nc-anw8Wmd7GHuKog3v]
module.tfe_notification_terraform.tfe_notification_configuration.default: Refreshing state... [id=nc-KQLuHzfeYK7s36cR]
module.tfe_variable_terraform["slack_webhook_url"].tfe_variable.default: Refreshing state... [id=var-JqEzfCvKPcdjuxub]
module.tfe_variable_terraform["hcloud_token_prod"].tfe_variable.default: Refreshing state... [id=var-Yu7Dvno9p93spJhL]
module.tfe_variable_terraform["hcloud_token_stage"].tfe_variable.default: Refreshing state... [id=var-RtXybBKxCViSxACD]
module.tfe_variable_terraform["AWS_SECRET_ACCESS_KEY"].tfe_variable.default: Refreshing state... [id=var-1Vahmf9mK6BnotLP]
module.tfe_variable_terraform["github_token"].tfe_variable.default: Refreshing state... [id=var-VF1xaVbq6tDw2mWB]
module.tfe_variable_terraform["AWS_ACCESS_KEY_ID"].tfe_variable.default: Refreshing state... [id=var-fDbEVrMvuGuA1TRw]
module.tfe_variable_terraform["TFE_TOKEN"].tfe_variable.default: Refreshing state... [id=var-buLFsUo8BCcvD6ni]
module.tfe_variable_terraform["hcloud_token_dev"].tfe_variable.default: Refreshing state... [id=var-W18fwUzdRvATpPWA]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.tfe_variable_terraform["AWS_ACCESS_KEY_ID"].tfe_variable.default has changed
  ~ resource "tfe_variable" "default" {
        id           = "var-fDbEVrMvuGuA1TRw"
      + value        = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.tfe_workspace_aws["aws-stage"].tfe_workspace.default has changed
  ~ resource "tfe_workspace" "default" {
        id                            = "ws-cHHxaAdTv94vAsAm"
        name                          = "aws"
      + remote_state_consumer_ids     = []
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tfe_notification_aws["aws-dev"].tfe_notification_configuration.default will be created
  + resource "tfe_notification_configuration" "default" {
      + destination_type = "slack"
      + email_addresses  = (known after apply)
      + email_user_ids   = (known after apply)
      + enabled          = false
      + id               = (known after apply)
      + name             = "slack"
      + triggers         = [
          + "run:errored",
          + "run:needs_attention",
        ]
      + url              = (sensitive)
      + workspace_id     = (known after apply)
    }

  # module.tfe_notification_aws["aws-prod"].tfe_notification_configuration.default will be created
  + resource "tfe_notification_configuration" "default" {
      + destination_type = "slack"
      + email_addresses  = (known after apply)
      + email_user_ids   = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + name             = "slack"
      + triggers         = [
          + "run:errored",
          + "run:needs_attention",
        ]
      + url              = (sensitive)
      + workspace_id     = (known after apply)
    }

  # module.tfe_notification_aws["aws-stage"].tfe_notification_configuration.default will be created
  + resource "tfe_notification_configuration" "default" {
      + destination_type = "slack"
      + email_addresses  = (known after apply)
      + email_user_ids   = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + name             = "slack"
      + triggers         = [
          + "run:errored",
          + "run:needs_attention",
        ]
      + url              = (sensitive)
      + workspace_id     = "ws-cHHxaAdTv94vAsAm"
    }

  # module.tfe_variable_aws_dev["AWS_ACCESS_KEY_ID"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "env"
      + description  = "The AWS access key to authenticate with Amazon Web Services (managed by Terraform)"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = false
      + workspace_id = (known after apply)
    }

  # module.tfe_variable_aws_dev["AWS_SECRET_ACCESS_KEY"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "env"
      + description  = "The AWS secret key to authenticate with Amazon Web Services (managed by Terraform)"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + workspace_id = (known after apply)
    }

  # module.tfe_variable_aws_prod["AWS_ACCESS_KEY_ID"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "env"
      + description  = "The AWS access key to authenticate with Amazon Web Services (managed by Terraform)"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = false
      + workspace_id = (known after apply)
    }

  # module.tfe_variable_aws_prod["AWS_SECRET_ACCESS_KEY"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "env"
      + description  = "The AWS secret key to authenticate with Amazon Web Services (managed by Terraform)"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + workspace_id = (known after apply)
    }

  # module.tfe_variable_aws_stage["AWS_ACCESS_KEY_ID"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "env"
      + description  = "The AWS access key to authenticate with Amazon Web Services (managed by Terraform)"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = false
      + workspace_id = "ws-cHHxaAdTv94vAsAm"
    }

  # module.tfe_variable_aws_stage["AWS_SECRET_ACCESS_KEY"].tfe_variable.default will be created
  + resource "tfe_variable" "default" {
      + category     = "env"
      + description  = "The AWS secret key to authenticate with Amazon Web Services (managed by Terraform)"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + workspace_id = "ws-cHHxaAdTv94vAsAm"
    }

  # module.tfe_variable_terraform["AWS_ACCESS_KEY_ID"].tfe_variable.default will be updated in-place
  ~ resource "tfe_variable" "default" {
        id           = "var-fDbEVrMvuGuA1TRw"
      - value        = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.tfe_workspace_aws["aws-dev"].tfe_workspace.default will be created
  + resource "tfe_workspace" "default" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + description                   = "Provision of Amazon Web Services resources"
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + global_remote_state           = false
      + id                            = (known after apply)
      + name                          = "aws-dev"
      + operations                    = (known after apply)
      + organization                  = "dhoppeIT"
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "aws",
          + "dev",
        ]
      + terraform_version             = (known after apply)
      + trigger_prefixes              = []
    }

  # module.tfe_workspace_aws["aws-prod"].tfe_workspace.default will be created
  + resource "tfe_workspace" "default" {
      + allow_destroy_plan            = false
      + auto_apply                    = false
      + description                   = "Provision of Amazon Web Services resources"
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + global_remote_state           = false
      + id                            = (known after apply)
      + name                          = "aws-prod"
      + operations                    = (known after apply)
      + organization                  = "dhoppeIT"
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "aws",
          + "prod",
        ]
      + terraform_version             = "1.1.3"
      + trigger_prefixes              = []

      + vcs_repo {
          + branch             = "main"
          + identifier         = "dhoppeIT/terraform-aws-config"
          + ingress_submodules = false
          + oauth_token_id     = "ot-c5iwRmKeBYGAyZSW"
        }
    }

  # module.tfe_workspace_aws["aws-stage"].tfe_workspace.default will be updated in-place
  ~ resource "tfe_workspace" "default" {
        id                            = "ws-cHHxaAdTv94vAsAm"
      ~ name                          = "aws" -> "aws-stage"
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 11 to add, 2 to change, 0 to destroy.


```

</details>

*Pusher: @dhoppe, Action: `pull_request`*